<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"a85f8c6e180cd781d503824cb3989135436228181508c0deffe7e8c293d24c6b","plan_job_ref":"Job CI #9 at https://github.com/jacobscunn07/terraform-workflows-poc/actions/runs/5594087036","plan_hash":"cfbabf5d67b0cc76822060772d508a42369415d66a064914e3c51670c1c3041e","plan_text_format":"text","version":"1.36.1"} -->
Terraform plan in __.__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.foo will be created
  + resource "local_file" "foo" {
      + content              = "default foo!!!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./foo.bar"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Release #26](https://github.com/jacobscunn07/terraform-workflows-poc/actions/runs/5594093665)